avr-rust/avrd/packs/xmegaa/ATxmega64A1.atdf
          </instance>
        </module>
        <module name="NVM" id="I6076-revH">
          <instance name="NVM">
            <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
          </instance>
          <instance name="FUSE">
            <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
          </instance>
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS" name="LOCKBIT"/>
          </instance>
          <instance name="PROD_SIGNATURES">
            <register-group address-space="prod_signatures" offset="0x00" name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
          </instance>
        </module>
        <module name="AC" id="I6077">
          <instance name="ACA">
            <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
          </instance>
          <instance name="ACB">
            <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
          </instance>
        </module>
        <module name="ADC" id="I6064">
          <instance name="ADCA">
            <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
          </instance>
          <instance name="ADCB">
            <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
          </instance>
        </module>
        <module name="DAC" id="I6059">
          <instance name="DACA">
            <register-group address-space="data" offset="0x0300" name-in-module="DAC" name="DACA"/>
          </instance>
          <instance name="DACB">
            <register-group address-space="data" offset="0x0320" name-in-module="DAC" name="DACB"/>
          </instance>
        </module>
        <module name="RTC" id="I6093">
          <instance name="RTC">
            <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
          </instance>
        </module>
        <module name="EBI" id="I3001">
          <instance name="EBI">
            <register-group address-space="data" offset="0x0440" name-in-module="EBI" name="EBI"/>
          </instance>
        </module>
        <module name="TWI" id="I6089">
          <instance name="TWIC">
            <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
          </instance>
          <instance name="TWID">
            <register-group address-space="data" offset="0x490" name-in-module="TWI" name="TWID"/>
          </instance>
          <instance name="TWIE">
            <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
          </instance>
          <instance name="TWIF">
            <register-group address-space="data" offset="0x4B0" name-in-module="TWI" name="TWIF"/>
          </instance>
        </module>
        <module name="PORT" id="I6075">
          <instance name="PORT_CFG">
            <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
          </instance>
          <instance name="VPORT0">
            <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
          </instance>
          <instance name="VPORT1">
            <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
          </instance>
          <instance name="VPORT2">
            <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
          </instance>
          <instance name="VPORT3">
            <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
          </instance>
          <instance name="PORTA">
            <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
          </instance>
          <instance name="PORTB">
            <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
          </instance>
          <instance name="PORTC">
            <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
          </instance>
          <instance name="PORTD">
            <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
          </instance>
          <instance name="PORTE">
            <register-group address-space="data" offset="0x0680" name-in-module="PORT" name="PORTE"/>
          </instance>
          <instance name="PORTF">
            <register-group address-space="data" offset="0x06A0" name-in-module="PORT" name="PORTF"/>
          </instance>
          <instance name="PORTH">
            <register-group address-space="data" offset="0x06E0" name-in-module="PORT" name="PORTH"/>
          </instance>
          <instance name="PORTJ">
            <register-group address-space="data" offset="0x0700" name-in-module="PORT" name="PORTJ"/>
          </instance>
          <instance name="PORTK">
            <register-group address-space="data" offset="0x0720" name-in-module="PORT" name="PORTK"/>
          </instance>
          <instance name="PORTQ">
            <register-group address-space="data" offset="0x07C0" name-in-module="PORT" name="PORTQ"/>
          </instance>
          <instance name="PORTR">
            <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
          </instance>
        </module>
        <module name="TC" id="I6090">
          <instance name="TCC0">
            <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
          </instance>
          <instance name="TCC1">
            <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
          </instance>
          <instance name="AWEXC">
            <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
