avr-rust/avrd/packs/xmegaa/ATxmega64A1.atdf
        <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Reference Select" mask="0x18" name="REFSEL" values="DAC_REFSEL"/>
          <bitfield caption="Left-adjust Result" mask="0x01" name="LEFTADJ"/>
        </register>
        <register caption="Event Input Control" name="EVCTRL" offset="0x03" size="1">
          <bitfield caption="Event Input Selection" mask="0x07" name="EVSEL" values="DAC_EVSEL"/>
        </register>
        <register caption="Timing Control" name="TIMCTRL" offset="0x04" size="1">
          <bitfield caption="Conversion Intercal" mask="0x70" name="CONINTVAL" values="DAC_CONINTVAL"/>
          <bitfield caption="Refresh Timing Control" mask="0x0F" name="REFRESH" values="DAC_REFRESH"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x05" size="1">
          <bitfield caption="Channel 1 Data Register Empty" mask="0x02" name="CH1DRE"/>
          <bitfield caption="Channel 0 Data Register Empty" mask="0x01" name="CH0DRE"/>
        </register>
        <register caption="Gain Calibration" name="GAINCAL" offset="0x08" size="1">
          <bitfield caption="Gain Calibration" mask="0x7F" name="GAINCAL"/>
        </register>
        <register caption="Offset Calibration" name="OFFSETCAL" offset="0x09" size="1">
          <bitfield caption="Offset Calibration" mask="0x7F" name="OFFSETCAL"/>
        </register>
        <register caption="Channel 0 Data" name="CH0DATA" offset="0x18" size="2"/>
        <register caption="Channel 1 Data" name="CH1DATA" offset="0x1A" size="2"/>
      </register-group>
      <value-group caption="Output channel selection" name="DAC_CHSEL">
        <value caption="Single channel operation (Channel A only)" name="SINGLE" value="0x00"/>
        <value caption="Dual channel operation (S/H on both channels)" name="DUAL" value="0x02"/>
      </value-group>
      <value-group caption="Reference voltage selection" name="DAC_REFSEL">
        <value caption="Internal 1V " name="INT1V" value="0x00"/>
        <value caption="Analog supply voltage" name="AVCC" value="0x01"/>
        <value caption="External reference on AREF on PORTA" name="AREFA" value="0x02"/>
        <value caption="External reference on AREF on PORTB" name="AREFB" value="0x03"/>
      </value-group>
      <value-group caption="Event channel selection" name="DAC_EVSEL">
        <value caption="Event Channel 0" name="0" value="0x00"/>
        <value caption="Event Channel 1" name="1" value="0x01"/>
        <value caption="Event Channel 2" name="2" value="0x02"/>
        <value caption="Event Channel 3" name="3" value="0x03"/>
        <value caption="Event Channel 4" name="4" value="0x04"/>
        <value caption="Event Channel 5" name="5" value="0x05"/>
        <value caption="Event Channel 6" name="6" value="0x06"/>
        <value caption="Event Channel 7" name="7" value="0x07"/>
      </value-group>
      <value-group caption="Conversion interval" name="DAC_CONINTVAL">
        <value caption="1 CLK / 2 CLK in S/H mode" name="1CLK" value="0x00"/>
        <value caption="2 CLK / 3 CLK in S/H mode" name="2CLK" value="0x01"/>
        <value caption="4 CLK / 6 CLK in S/H mode" name="4CLK" value="0x02"/>
        <value caption="8 CLK / 12 CLK in S/H mode" name="8CLK" value="0x03"/>
        <value caption="16 CLK / 24 CLK in S/H mode" name="16CLK" value="0x04"/>
        <value caption="32 CLK / 48 CLK in S/H mode" name="32CLK" value="0x05"/>
        <value caption="64 CLK / 96 CLK in S/H mode" name="64CLK" value="0x06"/>
        <value caption="128 CLK / 192 CLK in S/H mode" name="128CLK" value="0x07"/>
      </value-group>
      <value-group caption="Refresh rate" name="DAC_REFRESH">
        <value caption="16 CLK" name="16CLK" value="0x00"/>
        <value caption="32 CLK" name="32CLK" value="0x01"/>
        <value caption="64 CLK" name="64CLK" value="0x02"/>
        <value caption="128 CLK" name="128CLK" value="0x03"/>
        <value caption="256 CLK" name="256CLK" value="0x04"/>
        <value caption="512 CLK" name="512CLK" value="0x05"/>
        <value caption="1024 CLK" name="1024CLK" value="0x06"/>
        <value caption="2048 CLK" name="2048CLK" value="0x07"/>
        <value caption="4096 CLK" name="4096CLK" value="0x08"/>
        <value caption="8192 CLK" name="8192CLK" value="0x09"/>
        <value caption="16384 CLK" name="16384CLK" value="0x0A"/>
        <value caption="32768 CLK" name="32768CLK" value="0x0B"/>
        <value caption="65536 CLK" name="65536CLK" value="0x0C"/>
        <value caption="Auto refresh OFF" name="OFF" value="0x0F"/>
      </value-group>
    </module><module name="RTC" id="I6093" caption="Real-Time Counter">
      <register-group caption="Real-Time Counter" name="RTC" size="14">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
        </register>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
          <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL" values="RTC_COMPINTLVL"/>
          <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
        </register>
        <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
        <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
        <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
        <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
      </register-group>
