avr-rust/avrd/packs/xmegaa/ATxmega64A1.atdf
      <value-group caption="Chip Select SDRAM mode" name="EBI_CS_SDMODE">
        <value caption="Normal mode" name="NORMAL" value="0x00"/>
        <value caption="Load Mode Register command mode" name="LOAD" value="0x01"/>
      </value-group>
      <value-group caption="" name="EBI_SDDATAW">
        <value caption="4-bit data bus" name="4BIT" value="0x00"/>
        <value caption="8-bit data bus" name="8BIT" value="0x01"/>
      </value-group>
      <value-group caption="" name="EBI_LPCMODE">
        <value caption="Data muxed with addr byte 0" name="ALE1" value="0x00"/>
        <value caption="Data muxed with addr byte 0 and 1" name="ALE12" value="0x02"/>
      </value-group>
      <value-group caption="" name="EBI_SRMODE">
        <value caption="Addr byte 0 muxed with 1" name="ALE1" value="0x00"/>
        <value caption="Addr byte 0 muxed with 2" name="ALE2" value="0x01"/>
        <value caption="Addr byte 0 muxed with 1 and 2" name="ALE12" value="0x02"/>
        <value caption="No addr muxing" name="NOALE" value="0x03"/>
      </value-group>
      <value-group caption="" name="EBI_IFMODE">
        <value caption="EBI Disabled" name="DISABLED" value="0x00"/>
        <value caption="3-port mode" name="3PORT" value="0x01"/>
        <value caption="4-port mode" name="4PORT" value="0x02"/>
        <value caption="2-port mode" name="2PORT" value="0x03"/>
      </value-group>
      <value-group caption="" name="EBI_SDCOL">
        <value caption="8 column bits" name="8BIT" value="0x00"/>
        <value caption="9 column bits" name="9BIT" value="0x01"/>
        <value caption="10 column bits" name="10BIT" value="0x02"/>
        <value caption="11 column bits" name="11BIT" value="0x03"/>
      </value-group>
      <value-group caption="SDRAM Load Mode to Active delay" name="EBI_MRDLY">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
      </value-group>
      <value-group caption="SDRAM Row Cycle Delay" name="EBI_ROWCYCDLY">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
        <value caption="4 cycles" name="4CLK" value="0x04"/>
        <value caption="5 cycles" name="5CLK" value="0x05"/>
        <value caption="6 cycles" name="6CLK" value="0x06"/>
        <value caption="7 cycles" name="7CLK" value="0x07"/>
      </value-group>
      <value-group caption="SDRAM Row to Precharge Delay" name="EBI_RPDLY">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
        <value caption="4 cycles" name="4CLK" value="0x04"/>
        <value caption="5 cycles" name="5CLK" value="0x05"/>
        <value caption="6 cycles" name="6CLK" value="0x06"/>
        <value caption="7 cycles" name="7CLK" value="0x07"/>
      </value-group>
      <value-group caption="SDRAM Write Recovery Delay" name="EBI_WRDLY">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
      </value-group>
      <value-group caption="SDRAM Exit Self Refresh to Active Delay" name="EBI_ESRDLY">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
        <value caption="4 cycles" name="4CLK" value="0x04"/>
        <value caption="5 cycles" name="5CLK" value="0x05"/>
        <value caption="6 cycles" name="6CLK" value="0x06"/>
        <value caption="7 cycles" name="7CLK" value="0x07"/>
      </value-group>
      <value-group caption="SDRAM Row to Column Delay" name="EBI_ROWCOLDLY">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
        <value caption="4 cycles" name="4CLK" value="0x04"/>
        <value caption="5 cycles" name="5CLK" value="0x05"/>
        <value caption="6 cycles" name="6CLK" value="0x06"/>
        <value caption="7 cycles" name="7CLK" value="0x07"/>
      </value-group>
    </module><module name="TWI" id="I6089" caption="Two-Wire Interface">
      <register-group caption="" name="TWI_MASTER" size="7">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_MASTER_INTLVL"/>
          <bitfield caption="Read Interrupt Enable" mask="0x20" name="RIEN"/>
          <bitfield caption="Write Interrupt Enable" mask="0x10" name="WIEN"/>
          <bitfield caption="Enable TWI Master" mask="0x08" name="ENABLE"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Inactive Bus timeout" mask="0x0C" name="TIMEOUT" values="TWI_MASTER_TIMEOUT"/>
          <bitfield caption="Quick Command Enable" mask="0x02" name="QCEN"/>
          <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
        </register>
        <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
          <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_MASTER_CMD"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x03" size="1">
          <bitfield caption="Read Interrupt Flag" mask="0x80" name="RIF"/>
          <bitfield caption="Write Interrupt Flag" mask="0x40" name="WIF"/>
          <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
          <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
          <bitfield caption="Arbitration Lost" mask="0x08" name="ARBLOST"/>
          <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
          <bitfield caption="Bus State" mask="0x03" name="BUSSTATE" values="TWI_MASTER_BUSSTATE"/>
        </register>
        <register caption="Baurd Rate Control Register" name="BAUD" offset="0x04" size="1"/>
